app/views/flats/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "groups" ON "users"."id" = "groups"."user_id" WHERE "groups"."flat_id" = $1  [["flat_id", 1]]
---
    <div class="flex flex-wrap -m-2">
      <% @flat.users.each do |user| %>

SELECT "transactions".* FROM "transactions" WHERE "transactions"."flat_id" = $1  [["flat_id", 1]]
---
          <tbody class="bg-white divide-y divide-gray-200">
            <% @flat.transactions.each do |t| %>