app/views/flats/show.html.erb

    <div class="flex flex-wrap -m-2">
      <% @flat.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "groups" ON "users"."id" = "groups"."user_id" WHERE "groups"."flat_id" = $1  [["flat_id", 1]]