app/views/shared/_flatmate-card.html.erb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 AND "transactions"."flat_id" = $2  [["user_id", 1], ["flat_id", 2]]
---
      <% sum = 0 %>
      <% user.transactions.where(flat_id: flat.id).each do |t| %>