app/views/shared/_flat-card.html.erb

          <path d="M10 20a10 10 0 110-20 10 10 0 010 20zm1-5h1a3 3 0 000-6H7.99a1 1 0 010-2H14V5h-3V3H9v2H8a3 3 0 100 6h4a1 1 0 110 2H6v2h3v2h2v-2z"></path>
        </svg><%= flat.transactions.count %>
---
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."flat_id" = $1  [["flat_id", 1]]

          <path d="M2 6H0v2h2v2h2V8h2V6H4V4H2v2zm7 0a3 3 0 016 0v2a3 3 0 01-6 0V6zm11 9.14A15.93 15.93 0 0012 13c-2.91 0-5.65.78-8 2.14V18h16v-2.86z"></path>
        </svg><%= flat.users.count %>
---
SELECT COUNT(*) FROM "users" INNER JOIN "groups" ON "users"."id" = "groups"."user_id" WHERE "groups"."flat_id" = $1  [["flat_id", 1]]