app/views/invitations/show.html.erb

<p>You were invited by <%= @invited_by.first_name %> to "<%= @invitation.flat.title %>"</p>
---
SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]