app/controllers/flats_controller.rb

  def index
    @flats = Flat.select { |f| f.users.include?(current_user) }
---
SELECT "flats".* FROM "flats"
SELECT "users"."id" FROM "users" INNER JOIN "groups" ON "users"."id" = "groups"."user_id" WHERE "groups"."flat_id" = $1  [["flat_id", 3]]
SELECT 1 AS one FROM "users" INNER JOIN "groups" ON "users"."id" = "groups"."user_id" WHERE "groups"."flat_id" = $1 AND "users"."id" = $2 LIMIT $3  [["flat_id", 3], ["id", 5], ["LIMIT", 1]]

  def show
    @invitation = @flat.invitations.where(invited_by: current_user).last
    transactions = []
    @flat.transactions.each { |t| transactions << t.amount }
    @transactions_total = transactions.inject(:+)
    @transactions_total = 0 if @transactions_total.nil?
    users = @flat.users
    n_flatmates = users.count
    balance_per_flatmate = @transactions_total / n_flatmates

    users.each do |u|
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."flat_id" = $1 AND "invitations"."invited_by" = $2 ORDER BY "invitations"."id" DESC LIMIT $3  [["flat_id", 2], ["invited_by", 3], ["LIMIT", 1]]
INSERT INTO "flats" ("title", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["address", "Test"], ["created_at", "2020-09-04 00:34:17.283295"], ["updated_at", "2020-09-04 00:34:17.283295"]]
SELECT "invitations".* FROM "invitations" WHERE "invitations"."flat_id" = $1 AND "invitations"."invited_by" = $2 ORDER BY "invitations"."id" DESC LIMIT $3  [["flat_id", 5], ["invited_by", 3], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."flat_id" = $1  [["flat_id", 6]]
SELECT COUNT(*) FROM "users" INNER JOIN "groups" ON "users"."id" = "groups"."user_id" WHERE "groups"."flat_id" = $1  [["flat_id", 6]]
SELECT "users".* FROM "users" INNER JOIN "groups" ON "users"."id" = "groups"."user_id" WHERE "groups"."flat_id" = $1  [["flat_id", 5]]

  def create
    @flat = Flat.new(flat_params.slice(:title, :address))
    @flat.save!
    @group = Group.new
    @group.user = User.find(flat_params[:user_id])
    @group.flat = @flat
    @group.save!
---
INSERT INTO "flats" ("title", "address", "created_at", "updated_at", "balance") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test flat 5"], ["address", "jasldasdl"], ["created_at", "2020-09-07 01:06:19.076859"], ["updated_at", "2020-09-07 01:06:19.076859"], ["balance", 0.0]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "groups" ("user_id", "flat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["flat_id", 6], ["created_at", "2020-09-07 01:06:19.093955"], ["updated_at", "2020-09-07 01:06:19.093955"]]

  def update
    # raise
    @flat.update(flat_params)
---
UPDATE "flats" SET "title" = $1, "updated_at" = $2 WHERE "flats"."id" = $3  [["title", "Ella, Ella & Arie's place!"], ["updated_at", "2020-09-04 05:11:54.740568"], ["id", 1]]

  def destroy
    @flat.destroy
---
DELETE FROM "flats" WHERE "flats"."id" = $1  [["id", 3]]

  def set_flat
    @flat = Flat.find(params[:id])
---
SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]