app/controllers/flats_controller.rb

UPDATE "flats" SET "title" = $1, "updated_at" = $2 WHERE "flats"."id" = $3  [["title", "Ella, Ella & Arie's place!"], ["updated_at", "2020-09-04 05:11:54.740568"], ["id", 1]]
---
  def update
    # raise
    @flat.update(flat_params)

DELETE FROM "flats" WHERE "flats"."id" = $1  [["id", 3]]
---
  def destroy
    @flat.destroy

SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_flat
    @flat = Flat.find(params[:id])