app/controllers/groups_controller.rb

INSERT INTO "groups" ("user_id", "flat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["flat_id", 2], ["created_at", "2020-09-06 02:27:57.986777"], ["updated_at", "2020-09-06 02:27:57.986777"]]
---
  def create
    @group = Group.new(group_params)
    @group.save!