app/controllers/invitations_controller.rb

SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "invitations" ("token", "invited_by", "flat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["token", "288058c02d753f52ce59a5dda68812504295d3c8"], ["invited_by", 3], ["flat_id", 2], ["created_at", "2020-09-06 02:17:00.904256"], ["updated_at", "2020-09-06 02:17:00.904256"]]
---
  def new
    i = Invitation.new(invitation_params)
    i.flat = Flat.find(invitation_params[:flat_id])
    i.save!

SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users"."id" FROM "users" INNER JOIN "groups" ON "users"."id" = "groups"."user_id" WHERE "groups"."flat_id" = $1  [["flat_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    if @invitation.flat.user_ids.include?(current_user.id)
      flash[:notice] = 'You are already a part of this flat'
      redirect_to flat_path(@invitation.flat_id)
    else
      @invited_by = User.find(@invitation.invited_by)

SELECT "invitations".* FROM "invitations" WHERE "invitations"."token" = $1 LIMIT $2  [["token", "c12184f172a9b6b404ee7f4a37984a967ea1f25b"], ["LIMIT", 1]]
---
  def set_invitation
    @invitation = Invitation.find_by(token: params[:id])