app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.user = current_user
    @transaction.flat = Flat.find(transaction_params[:flat_id])
    @transaction.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "flats" SET "balance" = $1, "updated_at" = $2 WHERE "flats"."id" = $3  [["balance", 2.1], ["updated_at", "2020-09-06 06:50:51.140059"], ["id", 2]]
INSERT INTO "transactions" ("title", "amount", "user_id", "flat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Bacon"], ["amount", "9.10"], ["user_id", 2], ["flat_id", 1], ["created_at", "2020-09-04 01:10:29.982273"], ["updated_at", "2020-09-04 01:10:29.982273"]]

  def update
    @transaction.update(transaction_params)
---
UPDATE "transactions" SET "flat_id" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["flat_id", 1], ["updated_at", "2020-09-04 05:17:37.699206"], ["id", 3]]