app/models/user.rb

  def self.new_with_session(params, session)
    super.tap do |user|
      if data = session["devise.facebook_data"] && session["devise.facebook_data"]["extra"]["raw_info"]
        user.email = data["email"] if user.email.blank?
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "arie.theodorus.vanderpoel@gmail.com"], ["LIMIT", 1]]

  def self.from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_create do |user|
---
INSERT INTO "users" ("email", "encrypted_password", "first_name", "last_name", "created_at", "updated_at", "provider", "uid", "image") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "facebook"], ["uid", "10158410573071259"], ["LIMIT", 1]]